<?php   

    //开启session  
    session_start();  
    //echo '<meta charset="utf-8">';
    header("Content-Type:image/png");  
    header("X-Content-Type-Options:nosniff;"); //反X-Content-Type-Options Header Missing漏洞,低危,ZAP扫描
    header('X-Frame-Options:ALLOW-FROM https://himemory.191810.xyz/;'); // 修复X-Frame-Options Header Not Set漏洞,低危,ZAP扫描
    header('Content-Security-Policy: frame-ancestors https://himemory.191810.xyz/;'); // 针对chrome内核修复X-Frame-Options Header Not Set漏洞,低
 
 
    $codes = array('非历史主义', '票据交换所', '基马尔革命', '钢筋混凝土', '磁流体发电', '泼墨仙人图', '读书出版社', '花无百日红', '尼德兰美术', '西北野战军', '法向加速度', '最后的晚餐', '神经官能症', '凿四方眼儿', '半截回头人', '不朽之盛事', '害人先害己', '等边三角形', '事务所律师', '拱木不生危', '无记名投票', '黄淮海平原', '大查科平原', '鸯窭利摩罗', '瓦窑堡会议', '贺胜桥战役', '破镜不重照', '道家蓬莱山', '可望不可即', '词藻宏丽科', '三个火枪手', '蒲鲁东主义', '六十花甲子', '周瑜打黄盖', '有奶就是娘', '比较语言学', '固体物理学', '笑里暗藏刀', '航空发动机', '白鹿洞书院', '植物性神经', '瓜皮搭李皮', '南京大屠杀', '布尔什维克', '武梁祠画像', '木材蓄积量', '分子物理学', '落花难上枝', '九宫十三调', '三檐青罗伞', '无风三尺浪', '磁感应强度', '沙模儿铜钱', '秋山问道图', '直言三段论', '省略三段论', '肚束三条篾', '胜读十年书', '行政诉讼法', '老牛拖破车', '英吉利海峡', '计量地理学', '西印度群岛', '一铳子性儿', '大陆理性派', '科隆大教堂', '集体所有制', '纬度地带性', '事变知人心', '有限与无限', '中世纪艺术', '习惯成自然', '右佥都御史', '脚搭着脑杓', '萨噶达娃节', '流星十八跌', '商品交易所', '功到自然成', '数字式仪表', '鬑鬑颇有须', '司母戊方鼎', '土鼠随金虎', '热锅上蚂蚁', '推销员之死', '长江万里图', '罪恶的黑手', '顾头不顾尾', '北京图书馆', '吃粮不管事', '宪法性法律', '万事开头难', '青年心理学', '半自动步枪', '维多利亚地', '狮子身中虫', '十八般兵器', '冲积期化石', '旺多姆圆柱', '三三制政权', '三年不窥园', '欲得而甘心', '包法利夫人', '吃人家嘴软', '做官当老爷', '廿四考中书', '三氧化二砷', '三五七言诗', '受伤的野牛', '一夫多妻制', '毛里塔尼亚', '波士顿惨案', '锣齐鼓不齐', '原材料工业', '垂直平分线', '司马昭之心', '摩托化步兵', '整理党务案', '无利不起早', '强激光武器', '燕云十六州', '来世不可待', '羊欣白练裙', '书剑恩仇录', '三万六千日', '西线无战事', '麦琪的礼物', '放射性微尘', '孔子庙堂碑', '科道两衙门', '朝开暮落花', '从祖祖父母', '不能赞一词', '悉尼歌剧院', '本机振荡器', '爱丁堡大学', '密歇根大学', '急趋无善迹', '富贵他人合', '绝热发动机', '阿姆斯特丹', '电影摄影机', '贵人多忘事', '折节下谋士', '一二八事变', '记一辆纺车', '联合国大会', '三思而后行', '橄榄球运动', '攀缘白珠树', '戊戌六君子', '拒俄义勇队', '乌鲁木齐市', '舍命不舍财', '井底引银瓶', '慧眼识英雄', '三十六字母', '身大力不亏', '人生路不熟', '小日月庄稼', '时间与空间', '大资产阶级', '黄生借书说', '清水出芙蓉', '经济计量学', '二元方程式', '古典式摔跤', '日出处天子', '敦煌变文集', '红色保险箱', '主体与客体', '患难见知己', '居民身份证', '亚穆苏克罗', '爪声不拉气', '直言极谏科', '油锅上蚂蚁', '巴比松画派', '黄果树瀑布', '艺高人胆大', '梧桐一叶落', '有天无日头', '毛泽东思想', '肝肾综合征', '道三不着两', '小草在歌唱', '日月无私照', '救人须救彻', '花岗岩头脑', '敌我识别器', '流行性感冒', '流水作业法', '鸟歌万岁乐', '全民所有制', '南澳大利亚', '一妻多夫制', '吉林陨石雨', '同位素化学', '手扶拖拉机', '碱性氧化物', '商务印书馆', '牟比乌斯带', '乡村女教师', '虎虎有生气', '埃特纳火山', '圣萨尔瓦多', '许可证贸易', '日内瓦学派', '三下五除二', '戤米囤饿杀', '磨扇坠着手', '玄武岩地貌', '上不得芦苇', '肉麻当有趣', '一掴一掌血', '埃涅阿斯纪', '贫贱亲戚离', '人老心不老', '无政府主义', '银样蜡枪头', '东林十八贤', '公车司马门', '捧土加泰山', '根治切除术', '大少爷作风', '故出入人罪', '本质与现象', '木本油料林', '环境经济学', '诉讼参加人', '大伙房水库', '中央档案馆', '欧罗巴人种', '所罗门群岛', '银样镴槍头', '对称多项式', '法人财产权', '脱皮儿裹剂', '爱沙尼亚人', '亡立锥之地', '烈火见真金', '瓦尔帕莱索', '易地则皆然', '至圣文宣王', '水米不沾牙', '金刚老儿当', '多用途货船', '化学方程式', '穿一条裤子', '地中海气候', '水平地带性', '非道德行为', '相对与绝对', '人在人情在', '骏马换倾城', '乒乓球运动', '写生珍禽图', '严师出高徒', '电压放大器', '麦积山石窟', '立克次氏体', '无官御史台', '最惠国待遇', '花岗岩地貌', '白玉莲花盏', '空气调节器', '和事不表理', '触电保安器', '人生如风灯', '柯尔克孜族', '大陆桥运输', '秋风扫落叶', '拉斐尔前派', '无表雪王章', '电压互感器', '上海屋檐下', '同步电动机', '摸不着头脑', '天文学大成', '自动取款机', '一假手之劳', '五岳真形图', '文学研究会', '一言以蔽之', '秦王破阵乐', '民主集中制', '比较成本说', '半导体化学', '破鼓乱人捶', '各肉儿各疼', '能书不择笔', '根菜类蔬菜', '洛迦诺会议', '内分泌系统', '八路军军歌', '总和生育率', '水运仪象台', '分镜头剧本', '三垂线定理', '狭义相对论', '木偶奇遇记', '调频收音机', '老学庵笔记', '气温日较差', '机械化部队', '一觉扬州梦', '爆炸性新闻', '减字木兰花', '企业经营权', '竹筒倒豆子', '两性氧化物', '新闻发布会', '肋底下插柴', '依葫芦画瓢', '信号发生器', '合成洗衣粉', '怒从心上起', '南唐二主词', '公共关系学', '苏台德事件', '奥林匹克日', '光化学烟雾', '亚声速飞机', '群众艺术馆', '上诉不加刑', '民族共同语', '单弦牌子曲', '现代咨询学', '朝天一炷香', '天不转地转', '泡泡口香糖', '加那利寒流', '一二九运动', '英雄出少年', '吾家千里驹', '电子计算机', '仰光大金塔', '古典经济学', '天下无难事', '厄里倪厄斯', '萨尔贡王宫', '几内亚比绍', '东北野战军', '政治指导员', '鼻凹里砂糖', '一百八十度', '河水不洗船', '神经病患者', '国际博览会', '金华牧羊儿', '荐贤不荐愚', '莲花步步生', '卖狗皮膏药', '第一手材料', '无用武之地', '刘少奇选集', '必然与自由', '三打祝家庄', '具体与抽象', '一百二十行', '概念的概括', '士穷见节义', '新产品开发', '惟有读书高', '图穷匕首见', '政策性银行', '替古人担忧', '反雷达导弹', '中看不中用', '同进士出身', '隔行如隔山', '新四军军歌', '蜉蝣撼大树', '三对面先生', '东非大裂谷', '现金出纳账', '波斯细密画', '黄天荡之战', '意大利战争', '十三镮金带', '土壤地理学', '人口决定论', '验光配镜业', '不可能事件', '冈仁波齐峰', '发展心理学', '做私商勾当', '唐古拉山脉', '麦哲伦海峡', '近地点高度', '聂斯脱利派', '黄河大合唱', '尚方斩马剑', '有鼻子有眼', '水口水电站', '笛卡儿坐标', '社会心理学', '醒世姻缘传', '使马鄂伦春', '太阳能电池', '法西斯细菌', '仲夏夜之梦', '不当家豁拉', '摩尔多瓦人', '箱儿里盛只', '王小二过年', '美拉尼西亚', '攻占泸定桥', '一代风骚主', '狗牙儿绦子', '温良恭俭让', '老牛拉破车', '超自动化船', '枯鱼过河泣', '垂死的狮子', '希望在人间', '标准大气压', '法曲献仙音', '倒驴不倒架', '扎什伦布寺', '索非亚盆地', '千奴共一胆', '政治地理学', '张良慕赤松', '西山会议派', '时势造英雄', '照葫芦画瓢', '大事不糊涂', '格廷根大学', '笔特黑衙门', '社会总供给', '军令重如山', '出生地主义', '小巫见大巫', '消费者权益', '可行性研究', '脚踩两只船', '铜斗儿家缘', '撒哈拉沙漠', '妻贤夫祸少', '望山走倒马', '十年九不遇', '镇南关起义', '恒星光谱型', '西澳大利亚', '恶虎不食子', '弄白马益钱', '同步发电机', '妙应寺白塔', '尽地主之谊', '黄胖摏年糕', '蚍蜉撼大木', '少年飘泊者', '一肚子坏水', '豆腐渣工程', '丑妇家中宝', '第四野战军', '读书破万卷', '好心办坏事', '太山石敢当', '井冽寒泉食', '送子天王图', '少年中国说', '有风方起浪', '运动性病症', '福尔赛世家', '孤儿救祖记', '液体温度计', '骑鹤上维扬', '聚乙烯塑料', '法兰克王国', '恨铁不成钢', '一打坠咕儿', '雪梨却流水', '知臣莫若君', '只长枪直入', '领主制经济', '不要进来啊', '食方丈于前', '电视系列片', '青山白云人', '印纹陶文化', '与天地同休', '杜陵风月手', '八十一种好', '应天府书院', '液化石油气', '赤雀衔丹书', '民事诉讼法', '越鸟巢南枝', '眼不见为凈', '生脚踏生地', '平阳府君阙', '主人翁精神', '民以食为本', '碱式碳酸铜', '准噶尔盆地', '布朗基主义', '集团购买力', '红外线通信', '英雄的十月', '抱瑟不吹竽', '日久见人心', '现代评论派', '圣人无常师', '有奶便认娘', '校外辅导员', '太阳能电站', '移厨吃饭汉', '人穷志不穷', '非正义战争', '蒙得维的亚', '加酶洗衣粉', '称家之有无', '无风不起浪', '主观与客观', '通用计算机', '土耳其海峡', '开口见喉咙', '三杯和万事', '大生产运动', '快刀斩乱丝', '地主制经济', '词学兼茂科', '不知者不罪', '此风不可长', '货币购买力', '青门緑玉房', '自扫门前雪', '东京梦华录', '鬼头蛤蟆眼', '知子莫若父', '汲汲于富贵', '逻辑联结词', '复分解反应', '死病无良医', '发光二极管', '摩斯硬度计', '猪姆摆尾利', '担水河头卖', '多慢则生乱', '吉尔吉斯人', '迷途的羔羊', '甲胄生虮虱', '黑便士邮票', '人民陪审员', '贼夫人之子', '售胝足之药', '眼生蕉叶白', '胁底下插柴', '新文化运动', '南剑三先生', '巴尔干半岛', '司马牛之忧', '三一八惨案', '礼轻人意重', '胡笳十八拍', '动物心理学', '稠环化合物', '理论物理学', '自由式摔跤', '实业救国论', '伊洛瓦底江', '延安保卫战', '阿波罗计划', '五胡十六国', '军国民主义', '惠斯通电桥', '华北野战军', '克里姆林宫', '自由贸易区', '牙不约儿赤', '洪秀全演义', '旅游地类型', '电离方程式', '灰头土脸儿', '科学工业园', '三毛学生意', '蚁穿九曲珠', '经度地带性', '雅鲁藏布江', '地下建筑物', '吃软不吃硬', '安那其主义', '酒后吐真言', '玉板太乙船', '疾风扫秋叶', '华盛顿邮报', '伊瓜苏瀑布', '奥林匹克旗', '第一把交椅', '杂环化合物', '富贵草头露', '游刃有余地', '中学生守则', '倒用司农印', '差分放大器', '伸手不见掌', '雁门太守行', '平均海水面', '反眼不相识', '落笔妙天下', '早发白帝城', '知一不知十', '内容与形式', '男不对女敌', '历史宿命论', '麦克马洪线', '二十四诗品', '爱吃枣儿汤', '小儿麻痹症', '哈拉帕文化', '海军轰炸机', '光的波动说', '九品中正制', '一丝没两气', '国民参政会', '吸引与排斥', '战术核武器', '人口地理学', '一言抄百语', '海洋性气候', '公共休假日', '吕梁英雄传', '新几内亚岛', '鹿死不择音', '历史地理学', '喀斯特地貌', '亚美尼亚人', '容容多后福', '磕头如捣蒜', '证券交易所', '辛普朗隧道', '坦噶尼喀湖', '无所施其伎', '麻扎大砍刀', '扩大再生产', '放射性元素', '寅年用卯年', '卡式录音机', '杀人不眨眼', '索姆河战役', '蛟龙得云雨', '环境背景值', '凡尔赛和约', '天涯若比邻', '无足挂齿牙', '系狗当系颈', '万里犹比邻', '礼轻情意重', '反应性染料', '在中门对狙', '对外贸易区', '中断优先权', '锡矿山锑矿', '自然科学观', '轻器械体操', '保加利亚人', '苏伊士运河', '天高皇帝远', '舍命吃河豚', '黄道十二宫', '巴巴拉少校', '无巧不成话', '汽车制造厂', '飘风不终朝', '诺曼底登陆', '内华达山脉', '全躯保妻子', '临时抱佛脚', '虽多亦奚为', '覆巢无完卵', '国际电影节', '一杖一条痕', '武林旧事记', '十万八千里', '启普发生器', '帝国州大厦', '环境工程学', '染料中间体', '鲇鱼上竹竿', '捧心效西子', '郡斋读书志', '胸中万卷书', '受命不受辞', '日没处天子', '电子出版物', '发生学方法', '自然地理学', '哀的美敦书', '个人混合泳', '蚁串九曲珠', '没丝也有寸', '不知何许人', '非物质文化', '溪山行旅图', '高电压技术', '酒令如军令', '华东野战军', '两手攥空拳', '重金属污染', '司空不视涂', '言泉会九流', '三国连太郎', '皇姑屯事件', '十年磨一剑', '环境物理学', '没下颔的话', '诉讼参与人', '日内瓦大学', '股份合作制', '冰炭不相容', '走马阵头雨', '兵败如山倒', '分化与整合', '年青的一代', '步步生莲华', '同学究出身', '表面活性剂', '见弹求鸮炙', '肚里有偻罗', '非写实主义', '自动柜员机', '或然性推理', '抹一鼻子灰', '一心挂两头', '赵杲送曾哀', '左联五烈士', '七十二地煞', '一正压百邪', '五氧化二钒', '毕达哥拉斯', '眼不见为净', '求马于唐肆', '父系继承权', '费尔马猜想', '一碗水摆平', '狗肉不上桌', '流氓无产者', '人民委员会', '日月不可逾', '开尔文电桥', '结晶水合物', '金牛山遗址', '嘴大喉咙小', '箭穿着雁口', '完全四边形', '阴阳五行说', '一拳碎黄鹤', '汉字国际码', '一般与个别', '血小板计数', '禁止打广告', '不打不相识', '特别提款权', '乌孜别克族', '红河三角洲', '帕斯卡定理', '印度尼西亚', '滚汤泼老鼠', '屈子行吟图', '急急如律令', '海军航空兵', '五城十二楼', '国家指导价', '断送老头皮', '晶体振荡器', '大鱼吃小鱼', '低温物理学', '性能价格比', '电视发射塔', '城市美容师', '一沐三握发', '八十一元士', '巴马修道院', '百步无轻担', '傲慢与偏见', '既约多项式', '工业社会学', '所答非所问', '山不让土石', '封建士大夫', '城市社会学', '喷射混凝土', '众怒如水火', '知之为知之', '酸性氧化物', '志愿兵役制', '玉树后庭花', '朽木不可雕', '紧行无善踪', '冰炭不同器', '中国奥委会', '强宾不压主', '玉洞仙源图', '桃李满天下', '村弟子孩儿', '弃之如敝屣', '医学心理学', '群虱处裈中', '波多黎各岛', '出口加工区', '彼得卢惨案', '劳动合同制', '四方连邮票', '小学而大遗', '企业所得税', '热盘上蚁子', '桃李遍天下', '雨季不再来', '肉包子打狗', '溪山清远图', '马六甲海峡', '毗沙门天王', '行不行哥哥', '周恩来选集', '类新星变星', '老年性痴呆', '七叶一枝花', '与草木俱腐', '红嘴绿鹦哥', '伏尔加格勒', '祸生于纤纤', '国际劳动节', '无病一身轻', '一个心眼儿', '自然保护区', '基度山伯爵', '机器脚踏车', '无为天下先', '民族大迁徙', '水过地皮湿', '隔年旧历本', '吃硬不吃软', '蚂蚁啃骨头', '打鸭子上架', '喷气式飞机', '斯德哥尔摩', '艺多不压身', '新疆细羊毛', '白玉莲花杯', '内蒙古高原', '兄弟阋于墙', '东高止山脉', '临阵带兵书', '言人所不言', '电视差转台', '风土性植物', '平型关战斗', '普天堡战斗', '慢工出细活', '仆妾为雀鼠', '鸣鼓而攻之', '天字第一号', '真金不怕火', '早稻田大学', '槎头缩颈鳊', '有天没日头', '非农业用地', '毡袜裹脚靴', '正人先正己', '萍浏醴起义', '帕斯卡定律', '狗头上生角', '土地使用权', '敲诈勒索罪', '美国的悲剧', '一沐三渥发', '流亡者同盟', '一身都是胆', '历史因素论', '枪打出头鸟', '文章二百年', '本格拉寒流', '亚平宁山脉', '无所措手足', '太平洋战争', '新爱洛绮丝', '帕提侬神庙', '剩余价值率', '镇南关大捷', '臭氧层耗竭', '大津巴布韦', '太平军北伐', '五一六通知', '京师大学堂', '消费心理学', '城子崖遗址', '依本画葫芦', '地方性法规', '变容二极管', '机械化步兵', '呼和浩特市', '二十四节气', '与日月争光', '天下第一关', '罗斯陆缘冰', '旧石器时代', '拔戟成一队', '模数转换器', '滚动式计划', '三十六英雄', '棒头出孝子', '天体运行论', '三六九比势', '土星辐射带', '有志事竟成', '米糠油事件', '私视使目盲', '自食其恶果', '长随带驮子', '告个幺二三', '微积分电路', '依样画葫芦', '闲口说闲话', '半无产阶级', '社会民主党', '鸦飞不到山', '一地里胡拿', '三相三线制', '归去来兮辞', '雅各宾专政', '火箭雉尾炬', '夹袋中人物', '率土大将军', '一物克一物', '分支分配器', '一纸糊涂帐', '狼上狗不上', '十三环金带', '破罐子破摔', '后浪推前浪', '不以辞害志', '物以希为贵', '地球物理学', '一力降十会', '航空火箭弹', '鹿死不择荫', '货物周转量', '栈桥式码头', '如响之应声', '月球探测器', '方程式赛车', '电视接收机', '调制解调器', '滑铁卢战役', '十六字心传', '油干灯草尽', '反三角函数', '空心大老官', '没做道理处', '同离子效应', '祖国光复会', '第二次东征', '不正当竞争', '救民于水火', '劳动力市场', '热地上蚰蜒', '三尖两刃刀', '鸡肥不下蛋', '磁盘驱动器', '打破闷葫芦', '多伦多大学', '自己的园地', '功率放大器', '获得性免疫', '稳坐钓鱼台', '线形运动说', '千里江山图', '铁琴铜剑楼', '慕尼黑政策', '日德兰海战', '生命意志说', '武氏祠画像', '房地产市场', '三百六十行', '二卵弃干城', '托雷斯海峡', '黄道坐标系', '自然辩证法', '茅盾文学奖', '无线电运动', '发展经济学', '头柱炭治郎', '与日月齐光', '集成电路卡', '苛政猛于虎', '人生地不熟', '一籽一瓣儿', '爱斯基摩人', '拉斯维加斯', '俄瑞斯忒斯', '长矢射天狼', '黎明的河边', '柴立其中央', '奥斯特实验', '煤气发生炉', '耕者有其田', '无名的仁德', '威武不能屈', '中国万万岁'); 
    $code = $codes[rand(0,count($codes)-1)];
    $arr = array();
    for($i=0;$i<mb_strlen($code,'utf-8');$i++){
        $arr[$i] = mb_substr($code,$i,1,'utf-8');
    }
    //设置入session中，方便比对  
    $_SESSION["authcode"] = $code;  
 
    //开始绘图  
    $width = 200;  
    $height = 50;  
    $img = imagecreatetruecolor($width,$height);  
 
    //填充背景色  
    $backcolor = imagecolorallocate($img,mt_rand(0,55),mt_rand(0,55),mt_rand(0,55));  
    imagefill($img,0,0,$backcolor);  
 
    //获取随机较深颜色   
    for($i=0;$i<5;$i++){  
 
        $textcolor = imagecolorallocate($img,rand(50,180),rand(50,180),rand(50,180));   
        imagettftext($img,26,rand(-15,15),20+$i*35,35+rand(-10,10),$textcolor,'./fonts/font.ttf',(string)$arr[$i]);  
    }

    //干扰点  
    for($i=0; $i<rand(1000,10000); $i++) {  
        $pointcolor = imagecolorallocate($img, rand(50,180), rand(50,180), rand(50,180));  
        imagesetpixel($img, rand(1,$width-1), rand(1,$width-1), $pointcolor);  
    }  
      
    //干扰线  
    for($i=0; $i<rand(6,9); $i++){  
        $linecolor = imagecolorallocate($img, rand(80,180), rand(80,180), rand(80,180));  
        imageline($img, rand(1,$width-1), rand(1,$width/3-1), rand(1,$width-1), rand(1,$width/3-1), $linecolor);  
    }

    //雪花干扰  
    for($i=0; $i<rand(2,15); $i++){  
        $snowcolor = imagecolorallocate($img, rand(80,180), rand(80,180), rand(80,180));  
        imagestring($img, rand(1,6), rand(0, $width), rand(0,$height-1), '*', $snowcolor);  
    }

    //x干扰  
    for($i=0; $i<rand(2,15); $i++){  
        $xcolor = imagecolorallocate($img, rand(80,180), rand(80,180), rand(80,180));  
        imagestring($img, rand(1,6), rand(0, $width), rand(0,$height-1), 'x', $xcolor);  
    }


    //显示图片  
    imagepng($img);  
 
    //销毁图片  
    imagedestroy($img);  
?>  